#include "main.h"

//스크린 영역을 비웁니다.
void InitScreen(){
    SetAllColor(DEFAULT_BACKGROUND, DEFAULT_TEXT);
    for(int i = 1; i < 30; i++){
        GotoXY(2,i);
        printf("                                                                                     ");
    }
}

//기본 배경을 초기화합니다.
void InitBackGround(){
    GotoXY(0, 0);
    puts("┌──────────────────────────────────────────────────────────────────────────────────────┐");
    for(int i = 1; i < 30; i++){
        puts("│                                                                                      │");
    }
    puts("└──────────────────────────────────────────────────────────────────────────────────────┘");
    GotoXY(0, 31);
    puts("┌──────────────────────────────────────────────────────────────────────────────────────┐");
    for(int i = 0; i < 1; i++){
        puts("│                                                                                      │");
    }
    puts("└──────────────────────────────────────────────────────────────────────────────────────┘");
    WriteLineCenter(GAME_VERSION, 32);
}